
** Script.py

#+begin_src python :results output
  class Perceptron:
      def __init__(self, num_inputs=2, weights=[1,1]):
          self.num_inputs = num_inputs
          self.weights = weights

  cool_perceptron = Perceptron()

  print(cool_perceptron)
#+end_src

#+RESULTS:
: <__main__.Perceptron object at 0x72585a1021e0>
